-- Adminer 3.7.1 MySQL dump

SET NAMES utf8;
SET foreign_key_checks = 0;
SET time_zone = '+03:00';
SET sql_mode = 'NO_AUTO_VALUE_ON_ZERO';

CREATE DATABASE `pokerwebdb` /*!40100 DEFAULT CHARACTER SET utf8 */;
USE `pokerwebdb`;

DROP TABLE IF EXISTS `reg_token_user`;
CREATE TABLE `reg_token_user` (
  `id` int(11) NOT NULL COMMENT 'Идентификатор пользователя',
  `reg_token_confirm` varchar(36) NOT NULL COMMENT 'Токен подтверждения регистрации'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='Токены подтверждения регистрации';

INSERT INTO `reg_token_user` (`id`, `reg_token_confirm`) VALUES
(39,	'cc2135d7-ebec-4682-80bc-187047f98773'),
(40,	'2567b0ff-1216-44dd-90a1-9c2684a0edde'),
(41,	'77d7ff4e-1c40-43ef-9c0f-c827d128a0a2'),
(42,	'5b592d54-9266-4206-a76c-2e514ea00545'),
(43,	'58b929cf-463c-4b21-ab63-64763f212463'),
(44,	'd41913f4-7f68-43ca-b526-35558d9da670'),
(45,	'8de997fd-70d7-4a7e-af42-342a166be316'),
(46,	'719bfec3-016f-455c-9307-be575c578f05'),
(47,	'38af506b-eb46-4f23-9e08-814069831f86'),
(48,	'550b29d6-c516-4cf1-b743-293c130a8c42'),
(49,	'5288e48b-afd6-4035-bf42-e2f957f765a9');

DROP TABLE IF EXISTS `roles`;
CREATE TABLE `roles` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор роли',
  `role_name` varchar(200) NOT NULL COMMENT 'Название роли',
  `comment` varchar(500) NOT NULL COMMENT 'Коментарий',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='Роли пользователей';

INSERT INTO `roles` (`id`, `role_name`, `comment`) VALUES
(1,	'admin',	'Администраторы'),
(2,	'manager',	'Менеджеры'),
(3,	'user',	'Пользователи');

DROP TABLE IF EXISTS `stat_logins`;
CREATE TABLE `stat_logins` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор записи',
  `user_id` int(11) NOT NULL COMMENT 'Идентификатор пользователя',
  `login_time` datetime NOT NULL COMMENT 'Время входа',
  `logout` datetime NOT NULL COMMENT 'Время выхода',
  `ip` int(10) unsigned NOT NULL COMMENT 'ip адресс пользователя',
  `user_agent` varchar(200) NOT NULL COMMENT 'юзер-агент пользователя',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='Статистика авторизаций';


DROP TABLE IF EXISTS `users`;
CREATE TABLE `users` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'Идентификатор пользователя',
  `login` varchar(200) NOT NULL COMMENT 'Логин',
  `password` varchar(200) NOT NULL COMMENT 'Пароль',
  `email` varchar(200) NOT NULL,
  `surname` varchar(200) NOT NULL COMMENT 'Фамилия',
  `name` varchar(200) NOT NULL COMMENT 'Имя',
  `second_name` varchar(200) NOT NULL COMMENT 'Отчество',
  `tel` varchar(200) NOT NULL COMMENT 'Номер телефона',
  `register_date` datetime NOT NULL COMMENT 'Дата геристрации',
  `last_login` datetime NOT NULL COMMENT 'Время последнего входа',
  `banned` bit(1) NOT NULL COMMENT 'Отметка о блокировке',
  `banned_date` datetime NOT NULL COMMENT 'Дата блокировки',
  `banned_comment` varchar(500) NOT NULL COMMENT 'Причина блокировки',
  `banned_admin_id` int(11) NOT NULL COMMENT 'Идентификатор админа выдавшего бан',
  `activated` bit(1) NOT NULL COMMENT 'Статус активации пользователя',
  PRIMARY KEY (`id`)
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='Личные данные пользователей';

INSERT INTO `users` (`id`, `login`, `password`, `email`, `surname`, `name`, `second_name`, `tel`, `register_date`, `last_login`, `banned`, `banned_date`, `banned_comment`, `banned_admin_id`, `activated`) VALUES
(1,	'admin',	'admin',	'',	'',	'',	'',	'',	'2013-07-12 19:19:52',	'2013-07-12 19:19:52',	CONV('0', 2, 10) + 0,	'2013-07-12 19:19:52',	'',	0,	CONV('0', 2, 10) + 0),
(2,	'',	'',	'',	'',	'',	'',	'',	'2013-07-12 19:26:06',	'2013-07-12 19:26:06',	CONV('0', 2, 10) + 0,	'2013-07-12 19:26:06',	'',	0,	CONV('0', 2, 10) + 0),
(3,	'+u.login+',	'+u.password+',	'+u.email+',	'+u.surname+',	'+u.name+',	'',	'+u.tel+',	'2013-07-12 19:34:04',	'2013-07-12 19:34:04',	CONV('0', 2, 10) + 0,	'2013-07-12 19:34:04',	'',	0,	CONV('0', 2, 10) + 0),
(4,	'',	'',	'',	'',	'',	'',	'',	'2013-07-12 19:38:21',	'2013-07-12 19:38:21',	CONV('0', 2, 10) + 0,	'2013-07-12 19:38:21',	'',	0,	CONV('0', 2, 10) + 0),
(5,	'testUser',	'pestpass',	'test@test.ru',	'testsur',	'testname',	'',	'54343',	'2013-07-12 19:40:12',	'2013-07-12 19:40:12',	CONV('0', 2, 10) + 0,	'2013-07-12 19:40:12',	'',	0,	CONV('0', 2, 10) + 0),
(6,	'',	'привет',	'',	'',	'',	'',	'',	'2013-07-12 22:35:33',	'2013-07-12 22:35:33',	CONV('0', 2, 10) + 0,	'2013-07-12 22:35:33',	'',	0,	CONV('0', 2, 10) + 0),
(7,	'fds',	'fds',	'test@test.ru',	'da',	'dsa',	'',	'fsd',	'2013-07-15 02:07:31',	'2013-07-15 02:07:31',	CONV('0', 2, 10) + 0,	'2013-07-15 02:07:31',	'',	0,	CONV('0', 2, 10) + 0),
(8,	'fds',	'fds',	'test@test.ru',	'dsa',	'fd',	'',	'fdsa',	'2013-07-15 02:09:42',	'2013-07-15 02:09:42',	CONV('0', 2, 10) + 0,	'2013-07-15 02:09:42',	'',	0,	CONV('0', 2, 10) + 0),
(9,	'fsd',	'ds',	'test@test.ru',	'fds',	'dsf',	'',	'fds',	'2013-07-15 02:22:45',	'2013-07-15 02:22:45',	CONV('0', 2, 10) + 0,	'2013-07-15 02:22:45',	'',	0,	CONV('0', 2, 10) + 0),
(10,	'dsfvd',	'fdv',	'test@test.ru',	'df',	'fds',	'',	'fd',	'2013-07-15 02:24:51',	'2013-07-15 02:24:51',	CONV('0', 2, 10) + 0,	'2013-07-15 02:24:51',	'',	0,	CONV('0', 2, 10) + 0),
(11,	'vfdsvf',	'vfds',	'test@test.ru',	'fs',	'fdws',	'',	'g',	'2013-07-15 02:35:30',	'2013-07-15 02:35:30',	CONV('0', 2, 10) + 0,	'2013-07-15 02:35:30',	'',	0,	CONV('0', 2, 10) + 0),
(12,	'fdsf',	'fds',	'test@test.ru',	'fds',	'gfd',	'',	'gfd',	'2013-07-15 02:40:01',	'2013-07-15 02:40:01',	CONV('0', 2, 10) + 0,	'2013-07-15 02:40:01',	'',	0,	CONV('0', 2, 10) + 0),
(13,	'bjkb',	'bjkbj',	'test@test.ru',	'cx',	'fds',	'',	'jl',	'2013-07-15 02:43:24',	'2013-07-15 02:43:24',	CONV('0', 2, 10) + 0,	'2013-07-15 02:43:24',	'',	0,	CONV('0', 2, 10) + 0),
(14,	'ib',	'hjkgbhk',	'test@test.ru',	'jkl',	'jk',	'',	'kjhg',	'2013-07-15 02:44:35',	'2013-07-15 02:44:35',	CONV('0', 2, 10) + 0,	'2013-07-15 02:44:35',	'',	0,	CONV('0', 2, 10) + 0),
(15,	'bjk',	'jkb',	'test@test.ru',	'hk',	'bvhkj',	'',	'bjkl',	'2013-07-15 02:47:46',	'2013-07-15 02:47:46',	CONV('0', 2, 10) + 0,	'2013-07-15 02:47:46',	'',	0,	CONV('0', 2, 10) + 0),
(16,	'fds',	'gfds',	'test@test.ru',	'fgds',	'gfds',	'',	'gfds',	'2013-07-15 02:50:23',	'2013-07-15 02:50:23',	CONV('0', 2, 10) + 0,	'2013-07-15 02:50:23',	'',	0,	CONV('0', 2, 10) + 0),
(17,	'bhukv',	'hvkj',	'test@test.ru',	'sd',	'dsf',	'',	'v',	'2013-07-15 02:56:36',	'2013-07-15 02:56:36',	CONV('0', 2, 10) + 0,	'2013-07-15 02:56:36',	'',	0,	CONV('0', 2, 10) + 0),
(18,	'gfds',	'ds',	'test@test.ru',	'fds',	'fds',	'',	'gfds',	'2013-07-15 03:10:44',	'2013-07-15 03:10:44',	CONV('0', 2, 10) + 0,	'2013-07-15 03:10:44',	'',	0,	CONV('0', 2, 10) + 0),
(19,	'bkg',	'HG',	'test@test.ru',	'i',	'gui',	'',	'JGHJK',	'2013-07-15 03:21:11',	'2013-07-15 03:21:11',	CONV('0', 2, 10) + 0,	'2013-07-15 03:21:11',	'',	0,	CONV('0', 2, 10) + 0),
(20,	'',	'',	'test@test.ru',	'',	'',	'',	'',	'2013-07-15 03:22:31',	'2013-07-15 03:22:31',	CONV('0', 2, 10) + 0,	'2013-07-15 03:22:31',	'',	0,	CONV('0', 2, 10) + 0),
(21,	'bhkb',	'hjkb',	'test@test.ru',	'i',	'bih',	'',	'hjkb',	'2013-07-15 13:02:34',	'2013-07-15 13:02:34',	CONV('0', 2, 10) + 0,	'2013-07-15 13:02:34',	'',	0,	CONV('0', 2, 10) + 0),
(22,	'nkl',	'bjlkb',	'test@test.ru',	'bi',	'ji',	'',	'bjkl',	'2013-07-15 13:05:37',	'2013-07-15 13:05:37',	CONV('0', 2, 10) + 0,	'2013-07-15 13:05:37',	'',	0,	CONV('0', 2, 10) + 0),
(23,	'j',	'bjk',	'test@test.ru',	'bj',	'njk',	'',	'lbjk',	'2013-07-15 13:06:38',	'2013-07-15 13:06:38',	CONV('0', 2, 10) + 0,	'2013-07-15 13:06:38',	'',	0,	CONV('0', 2, 10) + 0),
(24,	'njkl',	'njkl',	'test@test.ru',	'bjkl',	'j',	'',	'lbjlk',	'2013-07-15 13:07:26',	'2013-07-15 13:07:26',	CONV('0', 2, 10) + 0,	'2013-07-15 13:07:26',	'',	0,	CONV('0', 2, 10) + 0),
(25,	'hkjb',	'hjk',	'test@test.ru',	'fds',	'fds',	'',	'bjk',	'2013-07-15 13:33:31',	'2013-07-15 13:33:31',	CONV('0', 2, 10) + 0,	'2013-07-15 13:33:31',	'',	0,	CONV('0', 2, 10) + 0),
(26,	'jkl432',	'bjkl',	'test@test.ru',	'jk',	'njkl',	'',	'bkl',	'2013-07-15 13:38:41',	'2013-07-15 13:38:41',	CONV('0', 2, 10) + 0,	'2013-07-15 13:38:41',	'',	0,	CONV('0', 2, 10) + 0),
(27,	' nm,',	'm,',	'test@test.ru',	'jlk',	'njkl',	'',	'm.,',	'2013-07-15 13:40:58',	'2013-07-15 13:40:58',	CONV('0', 2, 10) + 0,	'2013-07-15 13:40:58',	'',	0,	CONV('0', 2, 10) + 0),
(28,	'jklb',	'jkb',	'test@test.ru',	'nl',	'n',	'',	'bjk',	'2013-07-15 14:01:16',	'2013-07-15 14:01:16',	CONV('0', 2, 10) + 0,	'2013-07-15 14:01:16',	'',	0,	CONV('0', 2, 10) + 0),
(29,	'bkjh',	'bhjkghj',	'test@test.ru',	'bjk',	'bkjl',	'',	'jkgh',	'2013-07-15 14:05:19',	'2013-07-15 14:05:19',	CONV('0', 2, 10) + 0,	'2013-07-15 14:05:19',	'',	0,	CONV('0', 2, 10) + 0),
(30,	'7887',	'78',	'test@test.ru',	'jk',	'nhjkl',	'',	'78',	'2013-07-15 15:59:34',	'2013-07-15 15:59:34',	CONV('0', 2, 10) + 0,	'2013-07-15 15:59:34',	'',	0,	CONV('0', 2, 10) + 0),
(31,	'null',	'null',	'null',	'null',	'null',	'',	'null',	'2013-07-15 17:13:23',	'2013-07-15 17:13:23',	CONV('0', 2, 10) + 0,	'2013-07-15 17:13:23',	'',	0,	CONV('0', 2, 10) + 0),
(32,	'test12',	'\"+u.password+\"',	'\"+u.email+\"',	'\"+u.surname+\"',	'\"+u.name+\"',	'',	'\"+u.tel+\"',	'2013-07-15 18:22:19',	'2013-07-15 18:22:19',	CONV('0', 2, 10) + 0,	'2013-07-15 18:22:19',	'',	0,	CONV('0', 2, 10) + 0),
(33,	'test13',	'\"+u.password+\"',	'\"+u.email+\"',	'\"+u.surname+\"',	'\"+u.name+\"',	'',	'\"+u.tel+\"',	'2013-07-15 18:23:16',	'2013-07-15 18:23:16',	CONV('0', 2, 10) + 0,	'2013-07-15 18:23:16',	'',	0,	CONV('0', 2, 10) + 0),
(34,	'11111',	'11111',	'posle24@rambler.ru',	'fd',	'fd',	'',	'jln',	'2013-07-15 19:29:36',	'2013-07-15 19:29:36',	CONV('0', 2, 10) + 0,	'2013-07-15 19:29:36',	'',	0,	CONV('0', 2, 10) + 0),
(35,	'22222',	'22222',	'posle24@rambler.ru',	'hjk',	'bhj',	'',	'kjh',	'2013-07-15 19:47:04',	'2013-07-15 19:47:04',	CONV('0', 2, 10) + 0,	'2013-07-15 19:47:04',	'',	0,	CONV('0', 2, 10) + 0),
(36,	'33333',	'33333',	'posle24@rambler.ru',	'jnl',	'njl',	'',	'kl;nk',	'2013-07-15 19:49:55',	'2013-07-15 19:49:55',	CONV('0', 2, 10) + 0,	'2013-07-15 19:49:55',	'',	0,	CONV('0', 2, 10) + 0),
(37,	'44444',	'44444',	'posle24@rambler.ru',	'kml',	'mk',	'',	'njlk',	'2013-07-15 19:51:50',	'2013-07-15 19:51:50',	CONV('0', 2, 10) + 0,	'2013-07-15 19:51:50',	'',	0,	CONV('0', 2, 10) + 0),
(38,	'55555',	'55555',	'posle24@rambler.ru',	'njl',	'njl',	'',	'jl',	'2013-07-15 19:53:11',	'2013-07-15 19:53:11',	CONV('0', 2, 10) + 0,	'2013-07-15 19:53:11',	'',	0,	CONV('0', 2, 10) + 0),
(39,	'77777',	'77777',	'posle24@rambler.ru',	'lm',	'mk;k',	'',	'kl;nk',	'2013-07-15 19:58:11',	'2013-07-15 19:58:11',	CONV('0', 2, 10) + 0,	'2013-07-15 19:58:11',	'',	0,	CONV('1', 2, 10) + 0),
(40,	'88888',	'88888',	'posle24@rambler.ru',	'bhk',	'jhklb',	'',	'huoih',	'2013-07-15 20:15:19',	'2013-07-15 20:15:19',	CONV('0', 2, 10) + 0,	'2013-07-15 20:15:19',	'',	0,	CONV('1', 2, 10) + 0),
(41,	'99999',	'99999',	'posle24@rambler.ru',	'j',	'jn',	'',	'hbj',	'2013-07-15 20:18:52',	'2013-07-15 20:18:52',	CONV('0', 2, 10) + 0,	'2013-07-15 20:18:52',	'',	0,	CONV('1', 2, 10) + 0),
(42,	'111111',	'111111',	'posle24@rambler.ru',	'bjk',	'njk',	'',	'hjk',	'2013-07-15 20:24:07',	'2013-07-15 20:24:07',	CONV('0', 2, 10) + 0,	'2013-07-15 20:24:07',	'',	0,	CONV('1', 2, 10) + 0),
(43,	'444',	'444',	'posle24@rambler.ru',	'yui',	'gyuig',	'',	'vghjvghj',	'2013-07-15 20:33:13',	'2013-07-15 20:33:13',	CONV('0', 2, 10) + 0,	'2013-07-15 20:33:13',	'',	0,	CONV('0', 2, 10) + 0),
(44,	'4444',	'4444',	'posle24@rambler.ru',	'j',	'njkl',	'',	'4444',	'2013-07-15 20:36:50',	'2013-07-15 20:36:50',	CONV('0', 2, 10) + 0,	'2013-07-15 20:36:50',	'',	0,	CONV('0', 2, 10) + 0),
(45,	'33',	'33',	'posle24@rambler.ru',	'njkl',	'njlk',	'',	'33',	'2013-07-15 20:38:42',	'2013-07-15 20:38:42',	CONV('0', 2, 10) + 0,	'2013-07-15 20:38:42',	'',	0,	CONV('0', 2, 10) + 0),
(46,	'12',	'12',	'posle24@rambler.ru',	'nl',	'k',	'',	'12',	'2013-07-15 20:40:15',	'2013-07-15 20:40:15',	CONV('0', 2, 10) + 0,	'2013-07-15 20:40:15',	'',	0,	CONV('0', 2, 10) + 0),
(47,	'13',	'13',	'posle24@rambler.ru',	'njl',	'mkl',	'',	' k',	'2013-07-15 20:44:31',	'2013-07-15 20:44:31',	CONV('0', 2, 10) + 0,	'2013-07-15 20:44:31',	'',	0,	CONV('0', 2, 10) + 0),
(48,	'15',	'15',	'posle24@rambler.ru',	'bhjk',	'njh',	'',	'njk',	'2013-07-15 20:55:06',	'2013-07-15 20:55:06',	CONV('0', 2, 10) + 0,	'2013-07-15 20:55:06',	'',	0,	CONV('0', 2, 10) + 0),
(49,	'16',	'16',	'posle24@rambler.ru',	'bhkj',	'hjk',	'',	'bhkj',	'2013-07-15 20:56:46',	'2013-07-15 20:56:46',	CONV('0', 2, 10) + 0,	'2013-07-15 20:56:46',	'',	0,	CONV('1', 2, 10) + 0);

DROP TABLE IF EXISTS `user_roles`;
CREATE TABLE `user_roles` (
  `role_id` int(11) NOT NULL COMMENT 'Идентификатор роли',
  `user_id` int(11) NOT NULL COMMENT 'Идентификатор пользователя'
) ENGINE=MyISAM DEFAULT CHARSET=utf8 COMMENT='Соответствие ролей пользователям';

INSERT INTO `user_roles` (`role_id`, `user_id`) VALUES
(1,	3),
(4,	6),
(10,	10),
(10,	10),
(10,	10),
(3,	33),
(3,	32),
(3,	34),
(3,	35),
(3,	36),
(3,	37),
(3,	38),
(3,	39),
(3,	40),
(3,	41),
(3,	42),
(3,	43),
(3,	44),
(3,	45),
(3,	46),
(3,	47),
(3,	48),
(3,	49);

-- 2013-07-15 20:58:55
